module.exports = {
  "乾下乾上": {
    "pos": [
      "连根拔茅草，牵引及同类。征行，吉利。",
      "葫芦空又大，用来渡河，不可抛弃。丢失了钱。在中途会得友人相助。",
      "没有平地全无起伏的，没有前行而不返回的。占问艰难的事，没有祸患。不必担忧，只要保持诚信，定有饮食之福。",
      "飘飘然四处游逛。由于他邻人的关系而不能致富。不加防范，而轻信于人。",
      "帝乙嫁女。有福气，极其吉利。",
      "城墙倒塌在外壕里。从都城传来命令：不可用兵作战。占问，有困厄。"
    ],
    "desc": "《泰》卦：小的去，大的来。吉祥，顺利。"
  },
  "坤下坤上": {
    "pos": [
      "踩着霜，（意味）坚厚的冰层即将出现。",
      "（大地）平直、方正、广大，就算未加熟习，也无所不利。",
      "蕴含文采。适宜占问。有人从事王家事务，个人虽没有什么成就，但事情有好结果。",
      "结扎好袋口。没有祸患，也没有声誉。",
      "黄色裙裳。极其吉利。",
      "天龙与地母交合，它们的血色红黄相混。",
      "利于占问长远前景。"
    ],
    "desc": "《坤》卦：极其顺利，利于占问雌马的事。君子有所往，起先迷路，后来找到路，预示将获利。往西南方能赚到钱，东北方会破财。占问是否平安，吉利。"
  },
  "震下坎上": {
    "pos": [
      "徘徊不进。利于占问居处之事。利于封立诸侯。",
      "驾着车马兜兜转转，迟回难进；不是寇盗，是来求婚的。女子占问不育，十年后才生育。",
      "追猎麋鹿，却没有虞人相助，就这样闯进树林里。君子与其穷追到底，不如放弃。前去必遭困厄。",
      "驾着车马兜兜转转去求婚。前往，吉利，没有不利。",
      "囤积那肥肉。占问小事，吉利；占问大事，凶险。",
      "驾着车马兜兜转转，车上的人哭得血泪涟涟。"
    ],
    "desc": "《屯》卦：极其顺利，利于占问。不要有所往。利于封立诸侯。"
  },
  "坎下艮上": {
    "pos": [
      "启发愚蒙。有利于罪人解脱枷锁。如果前往，有困厄。",
      "包容愚蒙，吉利。娶妻，吉利。儿子能够当家。",
      "不要娶女子。见到财礼，丈夫会丧命。无所利。",
      "困于蒙昧。有困厄。",
      "（像）童真的小孩。吉利。",
      "击破愚蒙。不利于侵掠他人，利于抵御他人侵掠。"
    ],
    "desc": "《蒙》卦：顺利。不是我去求蒙昧无知的孩子，是蒙昧的孩子来求教于我。首次占筮，神灵告之结果；再两次、三次重复占筮，便是亵渎神灵，神灵被亵渎，当然不会告之结果。利于占问。"
  },
  "乾下坎上": {
    "pos": [
      "守候在郊野，利于有恒心。没有祸患。",
      "守候在沙地。稍有怨怼、不满之言，最后吉利。",
      "守候在泥滩，招致寇盗到来。",
      "守候在河沟。从洞穴里出来。",
      "安待于酒食中。占问，吉利。",
      "走进洞穴。有三位未经邀请的人士突然到来。敬而远之，终于吉利。"
    ],
    "desc": "《需》卦：胸怀诚信，无往不顺利。占问，吉利。利于涉渡大河。"
  },
  "坎下乾上": {
    "pos": [
      "不能完成所做的事。稍有怨谤之言，最后吉利。",
      "不能赢得诉讼，回去后便逃亡。他采邑里的数百户人家，没有灾祸。",
      "安享旧日的禄位与尊荣。占问，危险；最终吉利。有人从事王家事务，没有成就。",
      "不能赢得诉讼，回去后，服从判令，改变初衷。占问是否平安，吉利。",
      "争讼，极其吉利。",
      "有人赏赐给他官服革带，一朝之内，又几次把它剥夺。"
    ],
    "desc": "《讼》卦：胸怀诚信，保持戒惧。中途吉利，最后凶险。利于见贵人，不利于涉渡大河。"
  },
  "坎下坤上": {
    "pos": [
      "军队出兵须严守纪律。假如军纪废弛，凶险。",
      "在军队中，吉利，没有祸患。君王数次颁下嘉奖命令。",
      "军队有人用车子载运尸体。凶险。",
      "军队退守驻防。没有祸患。",
      "打猎猎得禽兽，有利于捕获俘虏。没有祸患。长子统率军队，次子用车子载运尸体。占问，凶险。",
      "国君颁布命令：或封诸侯建邦国，或立大夫领采邑；小民不得封赏、任用。"
    ],
    "desc": "《师》卦：为贵人占问，吉利，没有祸患。"
  },
  "坤下坎上": {
    "pos": [
      "胸怀诚信。亲辅他，没有祸患。诚信多得溢满盆，不驯服的方国也终于来朝。吉利。",
      "从内部去辅助他。占问，吉利。",
      "亲附于坏人。",
      "从外部去辅助他。占问，吉利。",
      "光明正大地相亲辅。君王网开一面，从三面包围驱赶禽兽，让前面的野兽逃脱了。居民不感惊怕。吉利。",
      "亲附他，丢了脑袋。凶险。"
    ],
    "desc": "《比》卦：吉利。再次占筮，筮问重大、长远的情况，没有祸患。不驯服的方国来朝，迟到的凶险。"
  },
  "乾下巽上": {
    "pos": [
      "从大路返回，又有何可责备的？吉利。",
      "牵着（牲畜）返回。吉利。",
      "车轮脱掉绑固车轴的绳索。夫妻反目失和。",
      "胸怀诚信。忧伤远离。没有祸患。",
      "胸怀诚信，紧密联系。由于他邻居的关系而致富。",
      "天下雨，雨停了，还得到车子乘载。占问妇女的事，危险。接近月中时，君子出行，凶险。"
    ],
    "desc": "《小畜》卦：顺利。阴云密布，没有下雨，从我西郊而来。"
  },
  "兑下乾上": {
    "pos": [
      "穿着素白的鞋子前去。没有祸患。",
      "走在宽广平坦的大路上。占问幽隐之人的事，吉利。",
      "瞎掉一只眼睛看东西，（怎看得清；）瘸了一条腿走路，（怎走得稳。）踩着老虎尾巴，老虎咬人。凶险。武夫当了国君。",
      "踩着老虎尾巴，怕得瑟瑟发抖。最后吉利。",
      "穿破了鞋子。占问，危险。",
      "审视所作所为，考察吉凶征兆。返回去，极其吉利。"
    ],
    "desc": "《履》卦：踩着老虎尾巴，不咬人。顺利。"
  },
  "坤下乾上": {
    "pos": [
      "连根拔茅草，牵引及同类。占问，吉祥，顺利。",
      "包裹俎肉。小人吉利，大人不吉。顺利。",
      "包裹美食。",
      "有命令颁下。没有祸患。同侪也一起得福。",
      "制止坏人作恶。大人吉利。快灭亡了，快灭亡了！（国家命脉已危在旦夕，就如）系于桑树丛的枝条上。",
      "推翻作恶的坏人。起先情况不妙，后来喜获成功。"
    ],
    "desc": "《否》卦：被坏人胡作非为。不利于占问君子之事。大的去，小的来。"
  },
  "离下乾上": {
    "pos": [
      "在门前聚集众人。没有祸患。",
      "在宗庙聚集众人。有困厄。",
      "在丛莽中埋伏军队，登上那高丘。数年不能兴兵。",
      "登上那城墙，却不发动进攻。吉利。",
      "众人起初号啕大哭，后来破涕为笑。大军终能胜利会师。",
      "同人、于郊1。无悔。",
      "在郊外聚集众人。没有悔恨、烦恼。"
    ],
    "desc": "《同人》卦：在野外聚集众人。顺利。利于涉渡大河。利于占问君子的事。"
  },
  "乾下离上": {
    "pos": [
      "不互相为害，便不成祸害。遭遇艰难也没有祸患。",
      "用大车乘载，有所往，没有祸患。",
      "公侯受天子宴飨，小民不可能。",
      "文采斐然，声容美盛。没有祸患。",
      "他信誉昭著，又有威仪。吉利。",
      "上天庇佑他。吉祥，无所不利。"
    ],
    "desc": "《大有》卦：极其顺利。"
  },
  "艮下坤上": {
    "pos": [
      "非常谦虚。君子以此态度涉渡大河，吉利。",
      "有声望而又谦虚。占问，吉利。",
      "有功劳而又谦虚。君子有好结果，吉利。",
      "无所不利。乐于助人而又谦虚。",
      "由于邻人的关系不能致富。利于停止攻伐，无所不利。",
      "有声望而又谦虚。利于出兵，征讨（不义的）城邑、邦国。"
    ],
    "desc": "《谦》卦：顺利。君子有好结果。"
  },
  "坤下震上": {
    "pos": [
      "有声望而耽于逸乐，凶险。",
      "躺在石上休憩，（纵然）不满一天（，也很惬意）。占问，吉利。",
      "大清早便寻欢作乐，会悔恨；其后再生悔恨。",
      "耽于游猎之乐，大有所获。不必疑虑，朋友会聚一起。",
      "占问疾病，长久不会死去。",
      "夜里寻欢作乐。功成复生变故。没有祸患。"
    ],
    "desc": "《豫》卦：有利于封立诸侯，行军作战。"
  },
  "震下兑上": {
    "pos": [
      "馆舍又再毁坏。占问，吉利。出门与人交往，有成效。",
      "绑住小孩，走失了汉子。",
      "绑住汉子，走失了小孩。追踪前去找寻，会得到。利于占问居处的事。",
      "追踪前去会有所获。占问，凶险。胸怀诚信，在路上结盟，又有何祸患？",
      "亲和应合于好人、美事，吉利。",
      "拘捕捆绑他们，随后连成一串。君王向西山献祭。"
    ],
    "desc": "《随》卦：极其顺利，利于占问。没有祸患。"
  },
  "巽下艮上": {
    "pos": [
      "整治父亲的事业。有儿子这样聪明能干，没有祸患。危险，最终吉利。",
      "整治母亲的事务。不能占问。",
      "整治父亲的事业。稍有悔恨、烦恼，没有大祸患。",
      "光大父亲的事业。前去，会遭困厄。",
      "整治父亲的事业，因而得到赞誉。",
      "不去事奉王侯，保持他高尚的志行。（凶险。）"
    ],
    "desc": "《蛊》卦：极其顺利。利于涉渡大河。从甲日前三日，到甲日后三日。"
  },
  "兑下坤上": {
    "pos": [
      "以感化方法治民。占问，吉利。",
      "以温和的手段治民，吉利，无所不利。",
      "以拑制的高压手段治民，没有好处。既已为此忧虑，祸患消除。",
      "亲力亲为治理民众，没有祸患。",
      "以明智之道治民，是国君应做的事。吉利。",
      "以敦厚之道治民，吉利，没有祸患。"
    ],
    "desc": "《临》卦：极其顺利，利于占问。到了八月会有凶险。"
  },
  "坤下巽上": {
    "pos": [
      "童稚的观察。小人没有祸患，君子有困厄。",
      "从门隙中偷偷观察。利于占问女子之事。",
      "观察我的子民百姓状况，决定进退行止。",
      "观览国家的荣光，利于做君王的宾客。",
      "观察、了解我的臣民百姓状况。君子没有祸患。",
      "观察其他国族臣民百姓的状况。君子没有祸患。"
    ],
    "desc": "《观》卦：以酒灌地迎神而不奉献祭品，胸怀诚信，神情肃穆。"
  },
  "震下离上": {
    "pos": [
      "穿戴着枷锁，遮没了双脚。没有祸患。",
      "啃咬肥肉，遮没了鼻子。没有祸患。",
      "啃咬干肉，中毒。有小困厄，没有祸患。",
      "啃咬带骨的干肉，得到铜箭头。利于占问艰难的事，吉利。",
      "啃咬干肉，得到黄铜（箭头）。占问，危险。没有祸患。",
      "担戴着枷锁，遮没了耳朵。凶险。"
    ],
    "desc": "《噬嗑》卦：顺利。利于刑狱诉讼之事。"
  },
  "离下艮上": {
    "pos": [
      "文饰他的脚。舍弃车子步行。",
      "文饰他的胡须。",
      "彩饰鲜明而润泽。占问长远情况，吉利。",
      "彩饰鲜明而多样，白马跑得飞快。不是寇盗，是来迎亲的。",
      "结彩文饰山园，仅有五小匹丝帛的财礼。有困厄，最终吉利。",
      "用白色文饰，没有祸患。"
    ],
    "desc": "《贲》卦：顺利。稍有利于前往。"
  },
  "坤下艮上": {
    "pos": [
      "完全毁掉床脚。占问，凶险。",
      "完全毁掉床板。占问，凶险。",
      "（逐渐向上）毁坏它。没有祸患。",
      "毁掉床席。凶险。",
      "用穿鱼般按顺序的方式宠幸宫人。无所不利。",
      "（留下）大的果实不吃。君子得到车子，小人拆毁庐舍。"
    ],
    "desc": "《剥》卦：不利于有所往。"
  },
  "震下坤上": {
    "pos": [
      "出门不远便返回，没有大悔恨。极其吉利。",
      "喜滋滋地返回。吉利。",
      "皱着眉头返回。危险。没有祸患。",
      "中途独自返回。",
      "被催迫而返回。没有悔恨烦恼。",
      "因迷路而返回。凶险，有灾殃。如果遣兵作战，终会大败，连同其国君也陷于凶险，以至十年不能征战。"
    ],
    "desc": "《复》卦：顺利。外出、回家都不会生病。朋友来访，没有祸患。沿着同一道路往返，七天便会回来。利于有所往。"
  },
  "震下乾上": {
    "pos": [
      "已无希望。前去，吉利。",
      "不能耕种、收获，不能垦荒、治田，（在那种情况下，）则利于有所往。",
      "意外的灾祸——有人拴住他的牛，过路人把它牵走了，村邑的人却遭殃。",
      "占问的事可行，没有祸患。",
      "意外的疾病，不须吃药，自会痊愈。",
      "已无希望，前行，有灾祸，无所利。"
    ],
    "desc": "《无妄》卦：极其顺利，利于占问。那些品行不端的会有祸殃。不利于有所往。"
  },
  "乾下艮上": {
    "pos": [
      "有危险，利于（及时）停止。",
      "车轮脱掉绑固车轴的绳索。",
      "骏马奔驰竞逐。利于占问艰难的事。停止战备行动。利于有所往。",
      "给小牛绑上护角的横木。极其吉利。",
      "小公猪长出了牙齿。吉利。",
      "蒙受上天的洪福。顺利。"
    ],
    "desc": "《大畜》卦：利于占问。不在家中吃饭，吉利。利于涉渡大河。"
  },
  "震下艮上": {
    "pos": [
      "舍弃你灵验的龟，看着我鼓动腮帮子。凶险。",
      "向下方求养，不正常，转而向上求养。出行，凶险。",
      "不能自养。占问，凶险。十年内不可有为。无所利。",
      "向下求养，吉利。像老虎紧紧盯着，其欲望非常强烈。没有祸患。",
      "不正常。占问居处的事，吉利。不要涉渡大河。",
      "追求保养。危险，但仍吉利。利于涉渡大河。"
    ],
    "desc": "《颐》卦：占问，吉利。观察面颊，（想到保养之道，）便自己求取食物。"
  },
  "巽下兑上": {
    "pos": [
      "用白茅草作衬垫。没有祸患。",
      "干枯的杨树再发新芽。老汉娶得他的年轻妻子。没有不利。",
      "栋梁弯折。凶险。",
      "栋梁高拱。吉利。发生意外变故，有困厄。",
      "干枯的杨树开花。老妇人嫁得个年轻丈夫。没有祸患，也没有声誉。",
      "在错误的地方蹚水过河，被水淹过头顶。凶险。没有祸患。"
    ],
    "desc": "《大过》卦：栋梁弯折。利于有所往。顺利。"
  },
  "坎下坎上": {
    "pos": [
      "坑中有坑。落入窖牢中。凶险。",
      "土牢有危险。有所求，会稍有所得。",
      "来到这土牢，坑既险又深。关进窖牢中，动弹不得，无可施为。",
      "一樽酒，一碗饭，加个瓦盆盛载，从窗户送进简陋的食物。最终没有祸患。",
      "土坑未填满，小丘已削平。没有祸患。",
      "用绳索捆绑，关在牢\u001f\u001f\u001f\u001f狱里，数年不能获释。凶险。"
    ],
    "desc": "《坎》卦：胸怀诚信，心意相通。顺利。前行有人相助。"
  },
  "离下离上": {
    "pos": [
      "步履庄重，恭敬对待他，没有祸患。",
      "黄色附丽其上。极其吉利。",
      "太阳斜挂天边，如不敲击瓦盆唱歌，那么老人便要嗟叹伤心。凶险。",
      "突然出现，蜂拥而来，焚烧呀，杀戮呀，抓住小孩就摔，残暴至极。",
      "涕泪滂沱地哀伤悲叹着。吉利。",
      "周王出征，传来捷报，斩首之外，他们还抓获一批俘虏。没有祸患。"
    ],
    "desc": "《离》卦：利于占问。顺利。饲养母牛，吉利。"
  },
  "艮下兑上": {
    "pos": [
      "抚弄她的足大趾。",
      "抚弄她的小腿。凶险。居家，吉利。",
      "抚弄她的大腿，把捉她的小腿。前往，有困厄。",
      "占问，吉利，没有悔恨烦恼。频密往来，朋友随顺了你的心愿。",
      "抚弄她的肩背。没有悔恨、烦恼。",
      "亲吻她的牙齿、面颊、舌头。"
    ],
    "desc": "《咸》卦：顺利，利于占问。娶女子，吉利。"
  },
  "巽下震上": {
    "pos": [
      "持久深挖。占问，凶险。无所利。",
      "悔咎消除。",
      "不能长保其德行，有时便会蒙羞受辱。占问，有困厄。",
      "打猎没有猎得禽兽。",
      "能长保其德行。占问妇女的事，吉利；占问男子的事，凶险。",
      "长期震荡。凶险。"
    ],
    "desc": "《恒》卦：顺利，没有祸患，利于占问。利于有所往。"
  },
  "艮下乾上": {
    "pos": [
      "最后才隐遁，危险。不要有所往。",
      "用黄牛皮绳捆绑，没有人受得了，摆脱为妙。",
      "羁留隐遁者，有病，危险。畜养男女奴仆，吉利。",
      "喜好隐遁，君子吉利。小人（不好遁，故）不吉。",
      "赞美隐遁。占问，吉利。",
      "远走高飞而隐遁，无所不利。"
    ],
    "desc": "《遁》卦：顺利。稍有利于占问。"
  },
  "乾下震上": {
    "pos": [
      "伤了脚。征行凶险。返回去。",
      "占问，吉利。",
      "小人逞其强力，君子不可如此。占问，危险。公羊抵触篱笆，它的角被绊住（，进退两难）。",
      "占问，吉利。悔疚消除。篱笆撞破了，羊角没被绊住；（终于）撞向大车的轮輹而受伤。",
      "在路边走失了羊。没有悔恨烦恼。",
      "公羊抵触篱笆，欲退不能，欲进不得。无所利。但经历艰难，便可获吉祥。"
    ],
    "desc": "《大壮》卦：利于占问。"
  },
  "坤下离上": {
    "pos": [
      "前进，退守。占问，吉利，悔咎消除。内怀诚信，心胸宽广，没有祸患。",
      "前进，发愁。占问，吉利。从他祖母那里受此洪福。",
      "众人一起前进。悔咎消除。",
      "像田鼠般瞻前顾后地前进。占问，危险。",
      "悔咎消除。不必顾虑得失。前去，吉利，无所不利。",
      "挺进其锋锐，用来攻打城邑。危险？吉利？还是无祸？占问结果是：有困厄。"
    ],
    "desc": "《晋》卦：康侯由于受赐之良马众多，一天之内连战皆捷。"
  },
  "离下坤上": {
    "pos": [
      "鸣雉飞行时，垂下它左边的翅膀；君子在路途，数天没进食。有所往，接待的主人有怨言。",
      "鸣雉伤了左腿。如果驾驭车马，马匹强壮，则吉利。",
      "鸣雉在南征狩猎中被射伤。猎获那大头怪兽。不利于占问疾病。",
      "鸣雉左腹受伤，在走出大门时，剜取了鸣雉的心肝。",
      "箕子蒙难，自晦其明。利于占问。",
      "光线不明，天色晦暗。太阳起初升上天空，后来落入地底。"
    ],
    "desc": "《明夷》卦：利于占问艰难的事。"
  },
  "离下巽上": {
    "pos": [
      "在家中预设防范，悔咎消除。",
      "没有错失，在家中主持家务。占问，吉利。",
      "家人关系严肃冷峻，有烦恼，危险，但（后来）吉利。妻子儿女嘻嘻哈哈，终有困厄。",
      "令家庭富裕。大吉。",
      "君王驾临家中，不必忧虑。前去，吉利。",
      "胸怀诚信，又有威仪。最终吉利。"
    ],
    "desc": "《家人》卦：利于占问女子的事。"
  },
  "兑下离上": {
    "pos": [
      "悔咎消除。丢失马匹，不用追寻，自己会回来。看见丑恶之人，没有祸患。",
      "在巷子里遇到主人家。没有祸患。",
      "看见车子被拖行，那牛起劲地拉，那人额上刺字，鼻子割掉。开头不妙，最后有好结果。",
      "离家旅人孤单之际，遇到个彪形大汉，互相信任。危险，没有祸患。",
      "悔咎消除。走进宗庙吃肉。前去，又有什么祸患？",
      "离家旅人孤单之际，看见有头猪背上全是泥巴，又有辆车载满鬼魅。起初拉开他的弓戒备，后来放下他的弓。那些人不是寇盗，是来迎亲的。前去，遇雨会吉利。"
    ],
    "desc": "《睽》卦：小事吉利。"
  },
  "艮下坎上": {
    "pos": [
      "前往遭遇险难，归来受到称赞。",
      "君王的臣仆饱历险难，非因私事的缘故。",
      "前往遭遇险难，归来安适舒坦。",
      "前往遭遇险难，归来安车代步。",
      "遭遇重大险难（或贵人遇险难），朋友齐来相助。",
      "前往遭遇险难，归来大有所获。吉利，利于见贵人。"
    ],
    "desc": "《蹇》卦：利西南方向，不利东北方向。利于见贵人。占问，吉利。"
  },
  "坎下震上": {
    "pos": [
      "没有祸患。",
      "打猎，猎得多只狐狸，得到黄铜箭镞。占问，吉利。",
      "背着东西乘车，招致强盗到来。占问，有困厄。",
      "放开你的脚步（前行），朋友自会到来和你应合。",
      "君子解开了束缚，吉利。符合小民百姓的愿望。",
      "王公在高峻的城墙上射鹰，射中了，无所不利。"
    ],
    "desc": "《解》卦：利西南方向。没有前往的目标，就返回吉利；如有前往的目标，及早动身吉利。"
  },
  "兑下艮上": {
    "pos": [
      "（遇到）祭祀的事情迅速前往。没有祸患。祭品可减少些。",
      "利于占问。征行，凶险。不要减损或增益它。",
      "三人同行，会损折一人；一人独行，会得到他的朋友。",
      "减轻他的疾病，令迅速痊愈。没有祸患。",
      "有人赠给他价值十朋的大宝龟，不可推却。极其吉利。",
      "不要减损或增益它，没有祸患。占问，吉利；利于有所往。会获得单身的奴仆。"
    ],
    "desc": "《损》卦：胸怀诚信，极其吉利，没有祸患，占问的事可行。利于有所往。两碗食物用来干什么？可用来祭祀。"
  },
  "震下巽上": {
    "pos": [
      "利于大兴土木。极其吉利，没有祸患。",
      "有人赠给他价值十朋的大宝龟，不可推却。占问长远前景，吉利。君王祭祀上帝，吉利。",
      "因凶祸之事而予人帮助，没有祸患。胸怀诚信，在中途执珪禀告王公。",
      "在中途禀告王公，王公听从。利于为殷商迁移封国。",
      "胸怀诚信，心意相通。不须占问，极吉无疑。合于我的德行。",
      "无人帮助他，却有人打击他。（这是由于）立志不够坚定，放弃自我修为，凶险。"
    ],
    "desc": "《益》卦：利于有所往。利于涉渡大河。"
  },
  "乾下兑上": {
    "pos": [
      "伤了脚趾，前去，支持不了。有祸患。",
      "警觉呼叫，入夜有军情。不必忧心。",
      "伤了面颊，有凶险。君子独个儿急急行走，碰到下雨，淋得湿透。虽然令人不快，总算没有祸患。",
      "臀部没块好肉，他走起路来趔趔趄趄。“牵羊归顺会令悔咎消除。”听起来这话靠不住。",
      "山羊蹦蹦跳跳，独在路中迅跑。没有祸患。",
      "忘记呼喊，终有凶险。"
    ],
    "desc": "《夬》卦：称颂（战绩）于君王朝廷，俘虏号哭着。有危急军情自边邑来报告。不利于出兵接战。利于有所往。"
  },
  "巽下乾上": {
    "pos": [
      "系在络丝车的金属脚架上。占问，吉利。有所往，显露凶兆。发情的猪被缚着，躁动难前。",
      "厨房里有鱼。没有祸患。不利于婚嫁。",
      "臀部没块好肉，他走起路来趔趔趄趄。危险，但没有大患。",
      "厨房没有鱼。出现凶兆。",
      "用杞柳篮子载瓜，含有文彩。有东西从天上掉下。",
      "碰触到它的角。有困厄，但无祸患。"
    ],
    "desc": "《姤》卦：女子（比男子）强壮，不要娶女子。"
  },
  "坤下兑上": {
    "pos": [
      "讲诚信却有始无终，以至昏乱病倒，而哭喊呼叫，（忽然又）破涕为笑。不须忧虑，前去，没有祸患。",
      "长久吉利，没有祸患。有诚信，大有利于行禴祭。",
      "病倒了，悲叹着。无所利。前去，没有祸患，有小困厄。",
      "大吉，没有祸患。",
      "在职任上忧劳得病，无可怨怪，因未能建立信誉。占问重大、长远的情况，悔疚消除。",
      "悲伤叹息，涕泪交流。没有怨怪于人。"
    ],
    "desc": "《萃》卦：顺利，君王驾临宗庙。利于见贵人。顺利，利于占问。杀大牲畜祭祀，吉利。利于有所往。"
  },
  "巽下坤上": {
    "pos": [
      "升进。大吉。",
      "有诚信，大有利于行禴祭。没有祸患。",
      "登上山上的城邑。",
      "君王祭祀岐山。吉利，没有祸患。",
      "占问，吉利。登上台阶。",
      "黑夜登高。利于占问辛勤工作之事。"
    ],
    "desc": "《升》卦：非常顺利。利于见贵人，不必忧虑。南征，吉利。"
  },
  "坎下兑上": {
    "pos": [
      "屁股受刑杖，被关进监牢，数年不见天日。凶险。",
      "因吃喝过度而不适，穿大红祭服的人刚好来到。利于举行祭祀。征行，凶险。没有祸患。",
      "被石头困绊，手撑在蒺藜上。走进他的居所，不见他的妻子。凶险。",
      "慢慢前来，被金黄色车子阻困。有困厄，但结果圆满。",
      "危险不安，被穿红色祭服之人困扰，但不久会得到解脱。利于举行祭祀。",
      "被藤蔓和木桩困绊，一动即生重重悔恨。征行，吉利。"
    ],
    "desc": "《困》卦：顺利。占问贵人之事，吉利，没有祸患。有些话听来不可靠。"
  },
  "巽下坎上": {
    "pos": [
      "井里满是泥泞，（井水）不堪食用。破旧的水井没有鸟兽（来饮用）。",
      "往水井深处射小鱼，陶罐被射破漏水。",
      "井水已除去污垢，却不食用，令我心中悲痛。可以汲水（饮用）。若君王英明，大家都蒙受他的福荫。",
      "用砖石修砌井壁。没有祸患。",
      "井水清澈，清凉的泉水可以饮用。",
      "水井已修固完毕，不要盖起来。有声誉，极其吉利。"
    ],
    "desc": "《井》卦：改建村邑，不改动水井，没有损失，也没有得益。（人们）在井上来来往往，井水干涸了，来到井边也未能汲水。井壁还把水瓶碰破了。凶险。"
  },
  "离下兑上": {
    "pos": [
      "用黄牛皮绳捆束加固。",
      "到革命之日，大大改变之。出征，吉利；没有祸患。",
      "出征，凶险。占问，有危险。革命经数度征战，（始获成功而）建立威信。",
      "悔咎消除，建立威信。改制革命，吉利。",
      "贵人变得如老虎般凶猛凌厉。不须占问，必有威望。",
      "君子变得如豹子般矫捷威猛。小民百姓也改变面容。出征，凶险。占问居处之事，吉利。"
    ],
    "desc": "《革》卦：到变革那天，大显其威信。非常顺利，利于占问，悔咎消除。"
  },
  "巽下离上": {
    "pos": [
      "鼎脚朝天颠倒过来，利于倒出废物。得到侍妾连同她的儿子。没有祸患。",
      "鼎中有食物。我的伴侣有病，不能来我这里。吉利。",
      "鼎耳脱落，难以搬动。肥美的野鸡肉吃不到；刚好下雨，美食受损，令人懊恼。但终于吉利。",
      "鼎脚折断，倒翻了王公的佳肴，将受重刑。凶险。",
      "鼎有金黄色的铜耳和横杠。利于占问。",
      "鼎有镶玉的横杠。大吉，无所不利。"
    ],
    "desc": "《鼎》卦：极其吉利，顺利。"
  },
  "震下震上": {
    "pos": [
      "雷霆袭来时，瑟瑟发抖，后来谈笑自若。吉利。",
      "雷霆袭来，危险。唉！丢失了钱财。（那贼人已）登上高山。不必追寻，七天后会失而复得。",
      "雷声吓得人浑身颤抖，但雷霆过处没有酿成灾祸。",
      "雷霆击落地上。",
      "雷霆往来轰响，危险。噢！幸而没损失。须行祭祀。",
      "雷声吓得人两腿哆嗦，惊惶四顾。征行，凶险。雷霆没有击中他自己和他邻居，没有祸患。亲戚有怨言。"
    ],
    "desc": "《震》卦：顺利。雷霆袭来时，瑟瑟发抖，不久谈笑自若。雷声震惊百里，手中那勺香酒也没有掉下。"
  },
  "艮下艮上": {
    "pos": [
      "关顾他的脚。没有祸患，利于占问长远前景。",
      "关顾他的小腿，便不能提起他的脚。他心里不痛快。",
      "关顾他的腰部，却撕裂了他的背肌。危险，内心焦灼痛苦。",
      "关顾他的身躯。没有祸患。",
      "关爱他的面颊，说话有条不紊。悔疚消除。",
      "厚加关顾。吉利。"
    ],
    "desc": "《艮》卦：（关注）他的后背，没看到他前身；走在他的庭院里，却不见他本人。没有祸患。"
  },
  "艮下巽上": {
    "pos": [
      "鸿雁登上河岸。小孩子遇险，有怨言。没有祸患。",
      "鸿雁登上礁石。快活优悠地吃喝。吉利。",
      "鸿雁登上高地。丈夫远行一去不回。妇人怀孕不幸流产。凶险。利于抵御寇盗。",
      "鸿雁飞上树木。有人得到做房椽的木料。没有祸患。",
      "鸿雁飞上山岭。妇人数年未能怀孕，但始终无人可凌跨她的地位。吉利。",
      "鸿雁飞上高山。它的羽毛可用作指麾的羽仪。吉利。"
    ],
    "desc": "《渐》卦：女子出嫁，吉利。利于占问。"
  },
  "兑下震上": {
    "pos": [
      "嫁女，用她的妹妹陪嫁。瘸了条腿能走路。征行，吉利。",
      "瞎了一只眼睛，能看见。利于占问幽隐之人的事。",
      "嫁女，用她的姐姐陪嫁；被遣回，再用她的妹妹陪嫁。",
      "嫁女，延误了婚期；迟嫁，因有所等待。",
      "帝乙嫁女（给周文王），那君夫人的衣着，不如她妹妹的衣裳漂亮。过了月中，吉利。",
      "女子捧着竹筐，空无祭品；男子宰杀羊只，没有鲜血。无所利。"
    ],
    "desc": "《归妹》卦：征行，凶险。无所利。"
  },
  "离下震上": {
    "pos": [
      "遇到那位女主人。十天之内，没有祸患。前去，会得友人相助。",
      "那阴影逐渐扩大，正午看见北斗星。前行，患上恐惧症；因胸怀诚信，终于释然。吉利。",
      "那黑影扩得更大，正午看见小星星。折断了他的右臂。没有祸患。",
      "那阴影逐渐缩小，正午看见北斗星。遇见那位小女主人。吉利。",
      "光辉显现，值得庆贺、赞美。吉利。",
      "把他的家宅建得高大宏伟，又遮蔽得严严实实。从他宅门窥看，却空寂无声，数年都不见人影。凶险。"
    ],
    "desc": "《丰》卦：顺利。君王驾临宗庙。不必忧虑，适宜在正午（祭祀）。"
  },
  "艮下离上": {
    "pos": [
      "旅人疲惫困顿，是他招致火灾的因由。",
      "旅人抵达客舍，身上带着他的钱财，获得忠心的奴仆。",
      "旅人失火焚毁了客舍，失去他忠心的奴仆。占问，危险。",
      "旅人去到新的住地，得回他的钱财。但心里仍不高兴。",
      "射雉鸡，一箭而毙。终于因此得到善射的美名。",
      "鸟儿焚毁了巢穴。旅人起初欢笑，后来号咷大哭。在路边走失了小牛。凶险。"
    ],
    "desc": "《旅》卦：稍顺利。占问行旅之事，吉利。"
  },
  "巽下巽上": {
    "pos": [
      "随宜进退。利于占问军人的事。",
      "蜷伏在床下，用众多史巫祝祷祈禳。吉利，没有祸患。",
      "皱着眉头俯伏。有困厄。",
      "悔疚消除。打猎猎得几种禽兽。",
      "占问，吉利，悔疚消除，无所不利。开头不妙，最后有好结果。在庚日之前三日到庚日后三日，吉利。",
      "蜷伏在床下，丧失了他的钱财。占问，凶险。"
    ],
    "desc": "《巽》卦：稍顺利。利于有所往，利于见贵人。"
  },
  "兑下兑上": {
    "pos": [
      "和睦而喜悦。吉利。",
      "同心而喜悦。吉利，悔疚消除。",
      "特意来取悦。凶险。",
      "商谈未妥，大病痊愈了。",
      "亲和应合于坏人，有危险。",
      "长久欢悦。"
    ],
    "desc": "《兑》卦：顺利，利于占问。"
  },
  "坎下巽上": {
    "pos": [
      "如果驾驭车马，马匹强壮，则吉利。悔疚消除。",
      "洪流涤荡，涌向那居所。悔疚消除。",
      "洪流涤荡那身躯。没有祸患。",
      "洪流涤荡那人群。极其吉利。洪水漫溢至山丘，非平常所能想象。",
      "洪水淹没那殿柱，人们大声呼叫。洪流涤荡王宫。没有祸患。",
      "大水把那忧伤涤荡远去。没有祸患。"
    ],
    "desc": "《涣》卦：顺利。君王驾临宗庙。利于见贵人，利于涉渡大河，利于占问。"
  },
  "兑下坎上": {
    "pos": [
      "不出内宅。没有祸患。",
      "不出家门。凶险。",
      "不加节制，便会忧伤悲叹。（此乃咎由自取，）无可怨怪于人。",
      "安于自我节制，顺利。",
      "乐于自我节制，吉利。前去，会得友人相助。",
      "以自我节制为苦。占问，凶险。悔疚消除。"
    ],
    "desc": "《节》卦：顺利。若以节制为苦，不能占问。"
  },
  "兑下巽上": {
    "pos": [
      "安定，吉利。有变故，不安宁。",
      "母鹤在背阴处鸣叫，小鹤和它应和。我有美酒，我与你共享。",
      "遭遇敌人，有的击鼓进军，有的停下，有的哭泣，有的唱歌。",
      "月中之后，有马匹走失。没有祸患。",
      "胸怀诚信，系念不绝。没有祸患。",
      "鸡高飞到天上。占问，凶险。"
    ],
    "desc": "《中孚》卦：用小猪和鱼（祭祀），吉利。利于涉渡大河。利于占问。"
  },
  "艮下震上": {
    "pos": [
      "鸟儿飞过，带来凶兆。",
      "错过了他的祖父，遇见他的祖母；没见到他的主人，遇见他的臣仆。没有祸患。",
      "没有越界，但要防止他；如果纵容，可能害死他。凶险。",
      "没有祸患。还未越界，和他遇上了。前去危险，必须告诫他。不要占问长远前景（意谓占问长远之事则不吉）。",
      "阴云密布，没有下雨，从我西郊而来。王公射取那在洞穴的禽兽。",
      "没有遇上，让他过去了。飞鸟将被网罗。凶险，这就叫灾祸。"
    ],
    "desc": "《小过》卦：顺利，利于占问。可做小事，不可干大事。鸟儿飞过留下它的声音，不适宜向上，适宜向下。大吉。"
  },
  "离下坎上": {
    "pos": [
      "拖拉那车轮（过河），浸湿了车子的尾部，没有祸患。",
      "妇人丢失了她的车窗帘，不必去找，七天内会失而复得。",
      "殷高宗征伐鬼方，数年战胜它。小民不得封赏，任用。",
      "漂亮衣裳外，再套件破衣衫。整天小心戒备。",
      "东面邻居杀牛祭祀，不如西面邻居的简朴祭祀，更能切实得到神灵的福佑。吉利。",
      "弄湿了他的头。危险。"
    ],
    "desc": "《既济》卦：顺利，稍有利于占问。开始吉利，最终出乱子。"
  },
  "坎下离上": {
    "pos": [
      "浸湿了它的尾部。有困厄。",
      "拖拉车轮（过河）。占问，吉利。利于涉渡大河。",
      "未获成功，征行，凶险。利于涉渡大河。",
      "占问，吉利。悔疚消除。大张旗鼓地征伐鬼方，三年（取胜），得到大邦殷的赏赐。",
      "占问，吉利。没有悔恨烦恼。君子光荣啊，有信誉、威望。吉利。",
      "符合饮酒的规矩，没有祸患。但（醉酒）淋湿了头，虽合规矩，也失去正道。"
    ],
    "desc": "《未济》卦：顺利。小狐狸渡河，将抵对岸时，浸湿了它的尾巴。无所利。"
  }
}